app/controllers/mesas_controller.rb

SELECT "mesas".* FROM "mesas"
---
  def index
    @mesas = Mesa.all

SELECT "mesas".* FROM "mesas" WHERE "mesas"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @mesa = Mesa.find(params[:id])

SELECT "mesas".* FROM "mesas" WHERE "mesas"."id" = ? LIMIT 1  [["id", "11"]]
---
  def edit
    @mesa = Mesa.find(params[:id])

INSERT INTO "mesas" ("c_mesa", "c_user", "created_at", "n_user", "updated_at") VALUES (?, ?, ?, ?, ?)  [["c_mesa", "1"], ["c_user", ""], ["created_at", Tue, 09 Sep 2014 13:50:27 UTC +00:00], ["n_user", ""], ["updated_at", Tue, 09 Sep 2014 13:50:27 UTC +00:00]]
---
  def create
    @mesa = Mesa.new(params[:mesa])

    respond_to do |format|
      if @mesa.save

SELECT "mesas".* FROM "mesas" WHERE "mesas"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "mesas" SET "c_user" = '1234', "n_user" = 'Augusto', "updated_at" = '2014-09-09 13:57:20.586063' WHERE "mesas"."id" = 15
---
  def update
    @mesa = Mesa.find(params[:id])

    respond_to do |format|
      if @mesa.update_attributes(params[:mesa])